# -- standard errors --
errors.header=<ul>
errors.prefix=<li><span style="color:red;">
errors.suffix=</span></li>
errors.footer=</ul>
# -- validator --
errors.invalid={0} \u306f\u7121\u52b9\u3067\u3059\u3002
errors.maxlength={0} \u306f {1} \u6587\u5b57\u4ee5\u5185\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
errors.minlength={0} \u306f {1} \u6587\u5b57\u4ee5\u4e0a\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
errors.range={0} \u306f {1} \u4ee5\u4e0a {2} \u4ee5\u4e0b\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
errors.required={0} \u304c\u5165\u529b\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
errors.byte={0} must be an byte.
errors.date={0} \u306f\u6709\u52b9\u306a\u65e5\u4ed8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
errors.double={0} \u306f\u6570\u5024\uff08\u5c0f\u6570\u70b9\u7b2c1\u4f4d\uff09\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
errors.float={0} must be an float.
errors.integer={0} must be an integer.
errors.long={0} must be an long.
errors.short={0} must be an short.
errors.creditcard={0} is not a valid credit card number.
errors.email={0} \u306e\u5f62\u5f0f\u304c\u59a5\u5f53\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
# -- manual --
errors.confirm=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u78ba\u8a8d\u5165\u529b\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
errors.already=\u5165\u529b\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fcID\u306f\u65e2\u306b\u767b\u9332\u3055\u308c\u3066\u3044\u307e\u3059\u3002
errors.login=\u30ed\u30b0\u30a4\u30f3\u3067\u304d\u307e\u305b\u3093\u3002\u30e6\u30fc\u30b6\u30fcID\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u78ba\u8a8d\u3057\u3066\u518d\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
errors.insert=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u30c7\u30fc\u30bf\u3092\u767b\u9332\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u3054\u9023\u7d61\u3044\u305f\u3060\u304d\u307e\u3059\u3088\u3046\u3088\u308d\u3057\u304f\u304a\u9858\u3044\u3044\u305f\u3057\u307e\u3059\u3002
errors.update=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30c7\u30fc\u30bf\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u3054\u9023\u7d61\u3044\u305f\u3060\u304d\u307e\u3059\u3088\u3046\u3088\u308d\u3057\u304f\u304a\u9858\u3044\u3044\u305f\u3057\u307e\u3059\u3002
# -- other --
errors.cancel=\u64cd\u4f5c\u306f\u30ad\u30e3\u30f3\u30bb\u30eb\u3055\u308c\u307e\u3057\u305f\u3002
errors.detail={0}
errors.general=\u30b7\u30b9\u30c6\u30e0\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u3054\u9023\u7d61\u3044\u305f\u3060\u304d\u307e\u3059\u3088\u3046\u3088\u308d\u3057\u304f\u304a\u9858\u3044\u3044\u305f\u3057\u307e\u3059\u3002
errors.token=\u8981\u6c42\u3092\u5b8c\u4e86\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u64cd\u4f5c\u3092\u7d9a\u884c\u3067\u304d\u307e\u305b\u3093\u3002
# -- welcome --
welcome.title=Tasklet
welcome.heading=Welcome!
welcome.message=To get started on your own application, copy the struts-blank.war to a new WAR file using the name for your application. Place it in your container's "webapp" folder (or equivalent), and let your container auto-deploy the application. Edit the skeleton configuration files as needed, restart your container, and you are on your way! (You can find the application.properties file with this message in the /WEB-INF/src/java/resources folder.)
# -- messages --
messages.noactivity=\u307e\u3060\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
messages.notask=\u3053\u306e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306b\u672a\u5b8c\u4e86\u306e\u30bf\u30b9\u30af\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u308f\u30fc\u3043\uff01